app/views/users/_form.html.haml

SELECT "roles".* FROM "roles"
---

  - for role in Role.all
    .field