app/views/posts/_form.html.haml

      %br
      = collection_select(:post, :blog_id, Blog.all, :id, :title, :prompt => true)
---
SELECT "blogs".* FROM "blogs"