app/controllers/posts_controller.rb

  def index

    fancygrid_for :posts do |grid|
      grid.columns_for :blog do |blog|
        blog.hidden :id, :user_id
        blog.attributes :title
      end

      grid.hidden :body
      grid.attributes :id, :blog_id, :title, :description
      grid.rendered :actions
      grid.url = user_blog_posts_path(scoped_user, scoped_blog)
      grid.find do |query|
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" IS NULL LIMIT 1

  def create
    @post = Post.new(params[:post])
    @post.save
---
INSERT INTO "posts" ("updated_at", "title", "body", "created_at", "description", "blog_id") VALUES ('2011-05-16 22:19:09.993518', 'test', 'adasdafasd', '2011-05-16 22:19:09.993518', NULL, 1)

  def update
    @post = Post.find(params[:id])
    @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "updated_at" = '2011-05-19 20:20:23.458713', "description" = 'Ipsum', "title" = 'Lorem', "body" = 'Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.' WHERE "posts"."id" = 1