app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("updated_at", "email", "username", "created_at") VALUES ('2011-05-16 22:39:59.648394', 'alex@dev.con', 'alex', '2011-05-16 22:39:59.648394')